src/post_tonal_overtone/org_files/use-a-MIDI-controller.org
* session with midi device in overtone
** start up and find info about overtone and midi devices
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(use 'overtone.core)
#+END_SRC

#+RESULTS:

Must be captialized?
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
overtone.version/OVERTONE-VERSION
#+END_SRC

#+RESULTS:
| :major | 0 | :minor | 10 | :patch | 1 | :snapshot | false |
<<<<<<< HEAD


| :major | 0 | :minor | 9 | :patch | 1 | :snapshot | false |
=======
>>>>>>> 51efe786282772e3493d3f3185d57fdb30cd9612
** (midi-connected-devices)
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(midi-connected-devices)
#+END_SRC



#+RESULTS:
: '((:description "Axiom A.I.R. Mini32 MIDI"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "MIDI"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x5b116300 "MIDI")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x6acafe38 "com.sun.media.sound.MidiInDevice@6acafe38")  :version "Unknown version") (:description "Axiom A.I.R. Mini32 HyperControl"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "HyperControl"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x5e430dfd "HyperControl")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x14a1b320 "com.sun.media.sound.MidiInDevice@14a1b320")  :version "Unknown version"))

: '((:description "Axiom A.I.R. Mini32 MIDI"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "MIDI"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc")  :version "Unknown version") (:description "Axiom A.I.R. Mini32 HyperControl"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "HyperControl"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x3886ef0a "HyperControl")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x42fac5ea "com.sun.media.sound.MidiInDevice@42fac5ea")  :version "Unknown version"))

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
({:description "Axiom A.I.R. Mini32 MIDI",
  :vendor "M-Audio",
  :sinks 0,
  :sources 2147483647,
  :name "MIDI",
  :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0],
  :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"],
  :overtone.studio.midi/dev-num 0,
  :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"],
  :version "Unknown version"}

 {:description "Axiom A.I.R. Mini32 HyperControl",
  :vendor "M-Audio",
  :sinks 0,
  :sources 2147483647,
  :name "HyperControl",
  :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0],
  :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x3886ef0a "HyperControl"],
  :overtone.studio.midi/dev-num 0,
  :device #object[com.sun.media.sound.MidiInDevice 0x42fac5ea "com.sun.media.sound.MidiInDevice@42fac5ea"],
  :version "Unknown version"})
#+END_SRC
* learn more about how overtone processes midi data
** (event-debug-on)
#+BEGIN_SRC clojure
(event-debug-on)
#+END_SRC

#+RESULTS:
: true

** note-on event with the event-debug-on function
