src/post_tonal_overtone/org_files/html-versions/use-a-MIDI-controller.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-02 Fri 15:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="b" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. session with midi device in overtone</a>
<ul>
<li><a href="#orgheadline1">1.1. start up and find info about overtone and midi devices</a></li>
<li><a href="#orgheadline2">1.2. (midi-connected-devices)</a></li>
</ul>
</li>
<li><a href="#orgheadline12">2. learn more about how overtone processes midi data</a>
<ul>
<li><a href="#orgheadline4">2.1. (event-debug-on)</a></li>
<li><a href="#orgheadline6">2.2. note-on event with the event-debug-on function</a>
<ul>
<li><a href="#orgheadline5">2.2.1. note-off event</a></li>
</ul>
</li>
<li><a href="#orgheadline7">2.3. debug off</a></li>
<li><a href="#orgheadline9">2.4. control-change starting point</a>
<ul>
<li><a href="#orgheadline8">2.4.1. knob 1</a></li>
</ul>
</li>
<li><a href="#orgheadline11">2.5. control-change ending point</a>
<ul>
<li><a href="#orgheadline10">2.5.1. knob2</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline18">3. make an 'instrument'</a>
<ul>
<li><a href="#orgheadline13">3.1. create a basic instrument for use with midi-poly-player</a></li>
<li><a href="#orgheadline14">3.2. make a player to use midi-poly-player and defined instrument</a></li>
<li><a href="#orgheadline15">3.3. stop the defined player&#x2013;doesn't do what you hope?</a></li>
<li><a href="#orgheadline16">3.4. create an event handler with on-event&#x2013;needs a real instrument for demo</a></li>
<li><a href="#orgheadline17">3.5. remove event handler</a></li>
</ul>
</li>
<li><a href="#orgheadline27">4. make a beeping instrument</a>
<ul>
<li><a href="#orgheadline19">4.1. create a very simple instrument</a></li>
<li><a href="#orgheadline20">4.2. kill all instances of running instrument&#x2013;contrast with killing with ID-specific number</a></li>
<li><a href="#orgheadline21">4.3. create a player using midi-poly-player to play the simple instrument</a></li>
<li><a href="#orgheadline22">4.4. stop the player&#x2013;doesn't do what you hope?</a></li>
<li><a href="#orgheadline23">4.5. stop the player by redefining with 'nil'</a></li>
<li><a href="#orgheadline24">4.6. stop all sounds</a></li>
<li><a href="#orgheadline25">4.7. create an event handler using on-event for using with simple-sine instrument</a></li>
<li><a href="#orgheadline26">4.8. stop player using remove-event-handler</a></li>
</ul>
</li>
<li><a href="#orgheadline37">5. make sounds (noise)</a>
<ul>
<li><a href="#orgheadline28">5.1. create an event handler with on-event and use control-change??</a></li>
<li><a href="#orgheadline29">5.2. basically works, but gets loud fast (vel vs. val error)</a></li>
<li><a href="#orgheadline30">5.3. println note-on and velocity message</a></li>
<li><a href="#orgheadline31">5.4. correctly grab and print out the cc-chanel and velocity (use :note and :velocity)</a></li>
<li><a href="#orgheadline32">5.5. correctly grab and use as vol the cc-chanel and velocity (use :note and :velocity)</a></li>
<li><a href="#orgheadline33">5.6. use control change with noise filter?</a></li>
<li><a href="#orgheadline34">5.7. use 'ctl' to make a real-time change</a></li>
<li><a href="#orgheadline35">5.8. actively filter noise with CC (remember, to use ctl, must have an active instance)</a></li>
<li><a href="#orgheadline36">5.9. make a recording</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> session with midi device in overtone</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> start up and find info about overtone and midi devices</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(use '<span style="color: #7CB8BB;">overtone.core</span>)
</pre>
</div>

<p>
Must be captialized?
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #7CB8BB;">overtone.version</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>OVERTONE-VERSION
</pre>
</div>
<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:major</td>
<td class="org-right">0</td>
<td class="org-left">:minor</td>
<td class="org-right">9</td>
<td class="org-left">:patch</td>
<td class="org-right">1</td>
<td class="org-left">:snapshot</td>
<td class="org-left">false</td>
</tr>
</tbody>
</table>
<p>
<code>=====</code>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 51efe786282772e3493d3f3185d57fdb30cd9612
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> (midi-connected-devices)</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-clojure">(midi-connected-devices)
</pre>
</div>



<pre class="example">
'((:description "Axiom A.I.R. Mini32 MIDI"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "MIDI"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc")  :version "Unknown version") (:description "Axiom A.I.R. Mini32 HyperControl"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "HyperControl"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x3886ef0a "HyperControl")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x42fac5ea "com.sun.media.sound.MidiInDevice@42fac5ea")  :version "Unknown version"))
</pre>

<div class="org-src-container">

<pre class="src src-clojure">({<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>,
  <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>,
  <span style="color: #BFEBBF;">:sinks</span> 0,
  <span style="color: #BFEBBF;">:sources</span> 2147483647,
  <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>,
  <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0],
  <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>],
  <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0,
  <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>],
  <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}

 {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 HyperControl"</span>,
  <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>,
  <span style="color: #BFEBBF;">:sinks</span> 0,
  <span style="color: #BFEBBF;">:sources</span> 2147483647,
  <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"HyperControl"</span>,
  <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"HyperControl"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 HyperControl"</span> 0],
  <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x3886ef0a <span style="color: #CC9393;">"HyperControl"</span>],
  <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0,
  <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x42fac5ea <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@42fac5ea"</span>],
  <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>})
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">2</span> learn more about how overtone processes midi data</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> (event-debug-on)</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-clojure">(event-debug-on)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.2</span> note-on event with the event-debug-on function</h3>
