src/post_tonal_overtone/org_files/use-a-MIDI-controller.org
** debug off
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(event-debug-off)
#+END_SRC

#+RESULTS:
: false

** control-change starting point
