src/post_tonal_overtone/org_files/html-versions/use-a-MIDI-controller.html
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.3</span> debug off</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-clojure">(event-debug-off)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.4</span> control-change starting point</h3>
