src/post_tonal_overtone/org_files/use-a-MIDI-controller.org
*** knob 1
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
event:  [:midi :control-change] ({:data2 1, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x18025326 "com.sun.media.sound.FastShortMessage@18025326"], :note 2, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 2, :data2-f 0.007874016, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 18651991003, :velocity 1, :velocity-f 0.007874016}) 
event:  [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0] ({:data2 1, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x18025326 "com.sun.media.sound.FastShortMessage@18025326"], :note 2, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 2, :data2-f 0.007874016, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 18651991003, :velocity 1, :velocity-f 0.007874016})
 
event:  (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0 :control-change 2) ({:data2 1, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x18025326 "com.sun.media.sound.FastShortMessage@18025326"], :note 2, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 2, :data2-f 0.007874016, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 18651991003, :velocity 1, :velocity-f 0.007874016})
 
event:  (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0 :control-change) ({:data2 1, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x18025326 "com.sun.media.sound.FastShortMessage@18025326"], :note 2, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 2, :data2-f 0.007874016, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 18651991003, :velocity 1, :velocity-f 0.007874016})

#+END_SRC
