src/post_tonal_overtone/org_files/use-a-MIDI-controller.org
** control-change ending point
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
event:  [:midi :control-change] ({:data2 127, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x42926a68 "com.sun.media.sound.FastShortMessage@42926a68"], :note 2, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 2, :data2-f 1.0, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 18652583742, :velocity 127, :velocity-f 1.0}) 
event:  [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0] ({:data2 127, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x42926a68 "com.sun.media.sound.FastShortMessage@42926a68"], :note 2, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 2, :data2-f 1.0, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 18652583742, :velocity 127, :velocity-f 1.0})
 
event:  (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0 :control-change 2) ({:data2 127, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x42926a68 "com.sun.media.sound.FastShortMessage@42926a68"], :note 2, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 2, :data2-f 1.0, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 18652583742, :velocity 127, :velocity-f 1.0})
 
event:  (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0 :control-change) ({:data2 127, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x42926a68 "com.sun.media.sound.FastShortMessage@42926a68"], :note 2, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 2, :data2-f 1.0, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 18652583742, :velocity 127, :velocity-f 1.0})

#+END_SRC

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
event:  [:midi :control-change] ({:data2 28, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x77f7f70a "com.sun.media.sound.FastShortMessage@77f7f70a"], :note 1, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 1, :data2-f 0.22047244, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 25614776293, :velocity 28, :velocity-f 0.22047244}) 
event:  [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0] ({:data2 28, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x77f7f70a "com.sun.media.sound.FastShortMessage@77f7f70a"], :note 1, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 1, :data2-f 0.22047244, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 25614776293, :velocity 28, :velocity-f 0.22047244})
 
event:  (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0 :control-change 1) ({:data2 28, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x77f7f70a "com.sun.media.sound.FastShortMessage@77f7f70a"], :note 1, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 1, :data2-f 0.22047244, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 25614776293, :velocity 28, :velocity-f 0.22047244})
 
event:  (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0 :control-change) ({:data2 28, :command :control-change, :channel 0, :msg #object[com.sun.media.sound.FastShortMessage 0x77f7f70a "com.sun.media.sound.FastShortMessage@77f7f70a"], :note 1, :dev-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :status :control-change, :data1 1, :data2-f 0.22047244, :device {:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :transmitter #object[com.sun.media.sound.MidiInDevice$MidiInTransmitter 0x17af0adf "com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"], :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1142bdd "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x117963cc "com.sun.media.sound.MidiInDevice@117963cc"], :version "Unknown version"}, :timestamp 25614776293, :velocity 28, :velocity-f 0.22047244})

#+END_SRC
