src/post_tonal_overtone/org_files/html-versions/use-a-MIDI-controller.html
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.5</span> control-change ending point</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-clojure">event:  [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>] ({<span style="color: #BFEBBF;">:data2</span> 127, <span style="color: #BFEBBF;">:command</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:channel</span> 0, <span style="color: #BFEBBF;">:msg</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.FastShortMessage</span> 0x42926a68 <span style="color: #CC9393;">"com.sun.media.sound.FastShortMessage@42926a68"</span>], <span style="color: #BFEBBF;">:note</span> 2, <span style="color: #BFEBBF;">:dev-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:status</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:data1</span> 2, <span style="color: #BFEBBF;">:data2-f</span> 1.0, <span style="color: #BFEBBF;">:device</span> {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>, <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>, <span style="color: #BFEBBF;">:sinks</span> 0, <span style="color: #BFEBBF;">:sources</span> 2147483647, <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>, <span style="color: #BFEBBF;">:transmitter</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice$MidiInTransmitter</span> 0x17af0adf <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0, <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>], <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}, <span style="color: #BFEBBF;">:timestamp</span> 18652583742, <span style="color: #BFEBBF;">:velocity</span> 127, <span style="color: #BFEBBF;">:velocity-f</span> 1.0}) 
event:  [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0] ({<span style="color: #BFEBBF;">:data2</span> 127, <span style="color: #BFEBBF;">:command</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:channel</span> 0, <span style="color: #BFEBBF;">:msg</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.FastShortMessage</span> 0x42926a68 <span style="color: #CC9393;">"com.sun.media.sound.FastShortMessage@42926a68"</span>], <span style="color: #BFEBBF;">:note</span> 2, <span style="color: #BFEBBF;">:dev-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:status</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:data1</span> 2, <span style="color: #BFEBBF;">:data2-f</span> 1.0, <span style="color: #BFEBBF;">:device</span> {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>, <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>, <span style="color: #BFEBBF;">:sinks</span> 0, <span style="color: #BFEBBF;">:sources</span> 2147483647, <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>, <span style="color: #BFEBBF;">:transmitter</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice$MidiInTransmitter</span> 0x17af0adf <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0, <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>], <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}, <span style="color: #BFEBBF;">:timestamp</span> 18652583742, <span style="color: #BFEBBF;">:velocity</span> 127, <span style="color: #BFEBBF;">:velocity-f</span> 1.0})

event:  (<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0 <span style="color: #BFEBBF;">:control-change</span> 2) ({<span style="color: #BFEBBF;">:data2</span> 127, <span style="color: #BFEBBF;">:command</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:channel</span> 0, <span style="color: #BFEBBF;">:msg</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.FastShortMessage</span> 0x42926a68 <span style="color: #CC9393;">"com.sun.media.sound.FastShortMessage@42926a68"</span>], <span style="color: #BFEBBF;">:note</span> 2, <span style="color: #BFEBBF;">:dev-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:status</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:data1</span> 2, <span style="color: #BFEBBF;">:data2-f</span> 1.0, <span style="color: #BFEBBF;">:device</span> {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>, <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>, <span style="color: #BFEBBF;">:sinks</span> 0, <span style="color: #BFEBBF;">:sources</span> 2147483647, <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>, <span style="color: #BFEBBF;">:transmitter</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice$MidiInTransmitter</span> 0x17af0adf <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0, <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>], <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}, <span style="color: #BFEBBF;">:timestamp</span> 18652583742, <span style="color: #BFEBBF;">:velocity</span> 127, <span style="color: #BFEBBF;">:velocity-f</span> 1.0})

event:  (<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0 <span style="color: #BFEBBF;">:control-change</span>) ({<span style="color: #BFEBBF;">:data2</span> 127, <span style="color: #BFEBBF;">:command</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:channel</span> 0, <span style="color: #BFEBBF;">:msg</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.FastShortMessage</span> 0x42926a68 <span style="color: #CC9393;">"com.sun.media.sound.FastShortMessage@42926a68"</span>], <span style="color: #BFEBBF;">:note</span> 2, <span style="color: #BFEBBF;">:dev-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:status</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:data1</span> 2, <span style="color: #BFEBBF;">:data2-f</span> 1.0, <span style="color: #BFEBBF;">:device</span> {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>, <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>, <span style="color: #BFEBBF;">:sinks</span> 0, <span style="color: #BFEBBF;">:sources</span> 2147483647, <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>, <span style="color: #BFEBBF;">:transmitter</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice$MidiInTransmitter</span> 0x17af0adf <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0, <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>], <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}, <span style="color: #BFEBBF;">:timestamp</span> 18652583742, <span style="color: #BFEBBF;">:velocity</span> 127, <span style="color: #BFEBBF;">:velocity-f</span> 1.0})
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">event:  [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>] ({<span style="color: #BFEBBF;">:data2</span> 28, <span style="color: #BFEBBF;">:command</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:channel</span> 0, <span style="color: #BFEBBF;">:msg</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.FastShortMessage</span> 0x77f7f70a <span style="color: #CC9393;">"com.sun.media.sound.FastShortMessage@77f7f70a"</span>], <span style="color: #BFEBBF;">:note</span> 1, <span style="color: #BFEBBF;">:dev-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:status</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:data1</span> 1, <span style="color: #BFEBBF;">:data2-f</span> 0.22047244, <span style="color: #BFEBBF;">:device</span> {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>, <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>, <span style="color: #BFEBBF;">:sinks</span> 0, <span style="color: #BFEBBF;">:sources</span> 2147483647, <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>, <span style="color: #BFEBBF;">:transmitter</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice$MidiInTransmitter</span> 0x17af0adf <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0, <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>], <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}, <span style="color: #BFEBBF;">:timestamp</span> 25614776293, <span style="color: #BFEBBF;">:velocity</span> 28, <span style="color: #BFEBBF;">:velocity-f</span> 0.22047244}) 
event:  [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0] ({<span style="color: #BFEBBF;">:data2</span> 28, <span style="color: #BFEBBF;">:command</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:channel</span> 0, <span style="color: #BFEBBF;">:msg</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.FastShortMessage</span> 0x77f7f70a <span style="color: #CC9393;">"com.sun.media.sound.FastShortMessage@77f7f70a"</span>], <span style="color: #BFEBBF;">:note</span> 1, <span style="color: #BFEBBF;">:dev-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:status</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:data1</span> 1, <span style="color: #BFEBBF;">:data2-f</span> 0.22047244, <span style="color: #BFEBBF;">:device</span> {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>, <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>, <span style="color: #BFEBBF;">:sinks</span> 0, <span style="color: #BFEBBF;">:sources</span> 2147483647, <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>, <span style="color: #BFEBBF;">:transmitter</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice$MidiInTransmitter</span> 0x17af0adf <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0, <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>], <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}, <span style="color: #BFEBBF;">:timestamp</span> 25614776293, <span style="color: #BFEBBF;">:velocity</span> 28, <span style="color: #BFEBBF;">:velocity-f</span> 0.22047244})

event:  (<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0 <span style="color: #BFEBBF;">:control-change</span> 1) ({<span style="color: #BFEBBF;">:data2</span> 28, <span style="color: #BFEBBF;">:command</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:channel</span> 0, <span style="color: #BFEBBF;">:msg</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.FastShortMessage</span> 0x77f7f70a <span style="color: #CC9393;">"com.sun.media.sound.FastShortMessage@77f7f70a"</span>], <span style="color: #BFEBBF;">:note</span> 1, <span style="color: #BFEBBF;">:dev-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:status</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:data1</span> 1, <span style="color: #BFEBBF;">:data2-f</span> 0.22047244, <span style="color: #BFEBBF;">:device</span> {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>, <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>, <span style="color: #BFEBBF;">:sinks</span> 0, <span style="color: #BFEBBF;">:sources</span> 2147483647, <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>, <span style="color: #BFEBBF;">:transmitter</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice$MidiInTransmitter</span> 0x17af0adf <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0, <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>], <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}, <span style="color: #BFEBBF;">:timestamp</span> 25614776293, <span style="color: #BFEBBF;">:velocity</span> 28, <span style="color: #BFEBBF;">:velocity-f</span> 0.22047244})

event:  (<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0 <span style="color: #BFEBBF;">:control-change</span>) ({<span style="color: #BFEBBF;">:data2</span> 28, <span style="color: #BFEBBF;">:command</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:channel</span> 0, <span style="color: #BFEBBF;">:msg</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.FastShortMessage</span> 0x77f7f70a <span style="color: #CC9393;">"com.sun.media.sound.FastShortMessage@77f7f70a"</span>], <span style="color: #BFEBBF;">:note</span> 1, <span style="color: #BFEBBF;">:dev-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:status</span> <span style="color: #BFEBBF;">:control-change</span>, <span style="color: #BFEBBF;">:data1</span> 1, <span style="color: #BFEBBF;">:data2-f</span> 0.22047244, <span style="color: #BFEBBF;">:device</span> {<span style="color: #BFEBBF;">:description</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span>, <span style="color: #BFEBBF;">:vendor</span> <span style="color: #CC9393;">"M-Audio"</span>, <span style="color: #BFEBBF;">:sinks</span> 0, <span style="color: #BFEBBF;">:sources</span> 2147483647, <span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"MIDI"</span>, <span style="color: #BFEBBF;">:transmitter</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice$MidiInTransmitter</span> 0x17af0adf <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice$MidiInTransmitter@17af0adf"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">full-device-key</span> [<span style="color: #BFEBBF;">:midi-device</span> <span style="color: #CC9393;">"M-Audio"</span> <span style="color: #CC9393;">"MIDI"</span> <span style="color: #CC9393;">"Axiom A.I.R. Mini32 MIDI"</span> 0], <span style="color: #BFEBBF;">:info</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo</span> 0x1142bdd <span style="color: #CC9393;">"MIDI"</span>], <span style="color: #BFEBBF;">:</span><span style="color: #BFEBBF;">overtone.studio.midi</span><span style="color: #BFEBBF; background-color: #3F3F3F;">/</span><span style="color: #BFEBBF;">dev-num</span> 0, <span style="color: #BFEBBF;">:device</span> #object[<span style="color: #7CB8BB;">com.sun.media.sound.MidiInDevice</span> 0x117963cc <span style="color: #CC9393;">"com.sun.media.sound.MidiInDevice@117963cc"</span>], <span style="color: #BFEBBF;">:version</span> <span style="color: #CC9393;">"Unknown version"</span>}, <span style="color: #BFEBBF;">:timestamp</span> 25614776293, <span style="color: #BFEBBF;">:velocity</span> 28, <span style="color: #BFEBBF;">:velocity-f</span> 0.22047244})
</pre>
</div>
</div>
