src/post_tonal_overtone/org_files/use-a-MIDI-controller.org
*** knob2
* make an 'instrument'
** create a basic instrument for use with midi-poly-player
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(definst steel-drum [note 60 amp 0.8]
  (let [freq (midicps note)]
    (* amp
       (env-gen (perc 0.01 0.2) 1 1 0 1 :action FREE)
       (+ (sin-osc (/ freq 2))
          (rlpf (saw freq) (* 1.1 freq) 0.4)))))
#+END_SRC

#+RESULTS:
** make a player to use midi-poly-player and defined instrument
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(def player (midi-poly-player steel-drum))
#+END_SRC

#+RESULTS:
: #'user/player
** stop the defined player--doesn't do what you hope?
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(midi-player-stop)
#+END_SRC

#+RESULTS:
: :handler-removed
** create an event handler with on-event--needs a real instrument for demo
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :note-on]
          (fn [e]
            (let [note (:note e)
                  vel  (:velocity e)]
              (your-instr note vel)))
          ::keyboard-handler)
#+END_SRC

#+RESULTS:

** remove event handler
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(remove-event-handler ::keyboard-handler)
#+END_SRC

#+RESULTS:
: :handler-removed

* make a beeping instrument
** create a very simple instrument 
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(definst boop [note 60 amp 0.3]
  (let [freq (midicps note)]
    (* amp (sin-osc freq))))

#+END_SRC

#+RESULTS:
: #<instrument: boop>
** kill all instances of running instrument--contrast with killing with ID-specific number
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(kill boop)
#+END_SRC

#+RESULTS:
: nil
** create a player using midi-poly-player to play the simple instrument
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(def booper (midi-poly-player boop))
#+END_SRC

#+RESULTS:
: #'overtone.examples.midi.keyboard/booper
** stop the player--doesn't do what you hope?
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(midi-player-stop)
#+END_SRC

#+RESULTS:
: :handler-removed

** stop the player by redefining with 'nil'
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(def booper (midi-poly-player nil))
#+END_SRC

#+RESULTS:
: #'overtone.examples.midi.keyboard/booper
** stop all sounds
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(stop)
#+END_SRC

#+RESULTS:
: nil
** create an event handler using on-event for using with simple-sine instrument
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :note-on]
          (fn [e]
            (let [note (:note e)
                  vel  (:velocity e)]
              (boop note (* 0.1 vel))))
          ::boop-handler)
#+END_SRC

#+RESULTS:
: :added-async-handler
** stop player using remove-event-handler
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(remove-event-handler ::boop-handler)
#+END_SRC

#+RESULTS:
: :handler-removed
* make sounds (noise)
** create an event handler with on-event and use control-change??
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(definst anoise [vol 0.5]
  (* (pink-noise)
     vol))

#+END_SRC

#+RESULTS:
: #<instrument: anoise>

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(anoise)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: overtone.examples.mid82a/anoise 289>

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(kill anoise)
#+END_SRC

#+RESULTS:
: nil
** basically works, but gets loud fast (vel vs. val error)
'anoise' (see above) must be running
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :control-change]
          (fn [e]
            (let [val (:data2 e)
                  vel  (:velocity e)]
              (anoise vel)))
          ::data-handler)
#+END_SRC

#+RESULTS:
: :added-async-handler

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(remove-event-handler ::data-handler)
#+END_SRC

#+RESULTS:
: :handler-removed
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :control-change]
          (fn [e]
            (let [val (:data2 e)
                  vel  (:velocity e)]
              (ctl anoise val)))
          ::ctldata-handler)
#+END_SRC

#+RESULTS:
: :added-async-handler

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(remove-event-handler ::ctldata-handler)
#+END_SRC

#+RESULTS:
: :handler-removed

** println note-on and velocity message
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :note-on] (fn [{note :note velocity :velocity}]
                             (println "Note: " note ", Velocity: " velocity))
          ::note-printer)
#+END_SRC

#+RESULTS:
: :added-async-handler

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(remove-event-handler ::note-printer)
#+END_SRC

#+RESULTS:
: :handler-removed
