src/post_tonal_overtone/org_files/html-versions/use-a-MIDI-controller.html
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">2.5.1</span> knob2</h4>
</div>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">3</span> make an 'instrument'</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.1</span> create a basic instrument for use with midi-poly-player</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">steel-drum</span> [note 60 amp 0.8]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [freq (midicps note)]
    (* amp
       (env-gen (perc 0.01 0.2) 1 1 0 1 <span style="color: #BFEBBF;">:action</span> <span style="color: #BFEBBF;">FREE</span>)
       (+ (sin-osc (/ freq 2))
          (rlpf (saw freq) (* 1.1 freq) 0.4)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.2</span> make a player to use midi-poly-player and defined instrument</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">player</span> (midi-poly-player steel-drum))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.3</span> stop the defined player&#x2013;doesn't do what you hope?</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-clojure">(midi-player-stop)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.4</span> create an event handler with on-event&#x2013;needs a real instrument for demo</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:note-on</span>]
          (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [e]
            (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (<span style="color: #BFEBBF;">:note</span> e)
                  vel  (<span style="color: #BFEBBF;">:velocity</span> e)]
              (your-instr note vel)))
          <span style="color: #BFEBBF;">::keyboard-handler</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">3.5</span> remove event handler</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::keyboard-handler</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">4</span> make a beeping instrument</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">4.1</span> create a very simple instrument</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">boop</span> [note 60 amp 0.3]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [freq (midicps note)]
    (* amp (sin-osc freq))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">4.2</span> kill all instances of running instrument&#x2013;contrast with killing with ID-specific number</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-clojure">(kill boop)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">4.3</span> create a player using midi-poly-player to play the simple instrument</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">booper</span> (midi-poly-player boop))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">4.4</span> stop the player&#x2013;doesn't do what you hope?</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-clojure">(midi-player-stop)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">4.5</span> stop the player by redefining with 'nil'</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">booper</span> (midi-poly-player <span style="color: #BFEBBF;">nil</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">4.6</span> stop all sounds</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">4.7</span> create an event handler using on-event for using with simple-sine instrument</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:note-on</span>]
          (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [e]
            (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (<span style="color: #BFEBBF;">:note</span> e)
                  vel  (<span style="color: #BFEBBF;">:velocity</span> e)]
              (boop note (* 0.1 vel))))
          <span style="color: #BFEBBF;">::boop-handler</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">4.8</span> stop player using remove-event-handler</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::boop-handler</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37"><span class="section-number-2">5</span> make sounds (noise)</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">5.1</span> create an event handler with on-event and use control-change??</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">anoise</span> [vol 0.5]
  (* (pink-noise)
     vol))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(anoise)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(kill anoise)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">5.2</span> basically works, but gets loud fast (vel vs. val error)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
'anoise' (see above) must be running
</p>
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>]
          (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [e]
            (<span style="color: #F0DFAF; font-weight: bold;">let</span> [val (<span style="color: #BFEBBF;">:data2</span> e)
                  vel  (<span style="color: #BFEBBF;">:velocity</span> e)]
              (anoise vel)))
          <span style="color: #BFEBBF;">::data-handler</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::data-handler</span>)
</pre>
</div>
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>]
          (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [e]
            (<span style="color: #F0DFAF; font-weight: bold;">let</span> [val (<span style="color: #BFEBBF;">:data2</span> e)
                  vel  (<span style="color: #BFEBBF;">:velocity</span> e)]
              (ctl anoise val)))
          <span style="color: #BFEBBF;">::ctldata-handler</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::ctldata-handler</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">5.3</span> println note-on and velocity message</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:note-on</span>] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{note <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
                             (println <span style="color: #CC9393;">"Note: "</span> note <span style="color: #CC9393;">", Velocity: "</span> velocity))
          <span style="color: #BFEBBF;">::note-printer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::note-printer</span>)
</pre>
</div>
</div>
</div>
