src/post_tonal_overtone/org_files/use-a-MIDI-controller.org
** correctly grab and print out the cc-chanel and velocity (use :note and :velocity)
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :control-change] (fn [{cc-channel :note velocity :velocity}]
                             (println "channel: " cc-channel ", Velocity: " velocity))
          ::cc-printer)
#+END_SRC

#+RESULTS:
: :added-async-handler

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(remove-event-handler ::cc-printer)
#+END_SRC

#+RESULTS:
: :handler-removed
** correctly grab and use as vol the cc-chanel and velocity (use :note and :velocity)
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :control-change] (fn [{cc-channel :note velocity :velocity}]
                                    (ctl anoise :vol (scale-range velocity 1 127 0 1)))
          ::cc-player)
#+END_SRC

#+RESULTS:
: :added-async-handler

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(remove-event-handler ::cc-player)
#+END_SRC

#+RESULTS:
: :handler-removed
** use control change with noise filter?
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
  (on-event [:midi :control-change]
            (fn [{cc-channel :note velocity :velocity}]
              (lpf (ctl anoise :vol (scale-range velocity 1 127 0 1))
                   10)
              ::cc-filterplayer))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(demo 10
  (lpf (* 0.5 (saw [339 440]))
       (mouse-x 10 10000)))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: overtone.exam82a/audition-synth 291>
** use 'ctl' to make a real-time change

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(definst an-fnoise [vol 0.1 ffreq 1000]
  (lpf (* (pink-noise)
          vol)
       ffreq))

#+END_SRC

#+RESULTS:
: #<instrument: an-fnoise>


#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(an-fnoise)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/an-fnoise 64>

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(kill an-fnoise)
#+END_SRC

#+RESULTS:
: nil

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(ctl an-fnoise :vol 0.5 :ffreq 4000)
#+END_SRC

#+RESULTS:
: #overtone.studio.inst.Inst{:name "an-fnoise", :params ({:name "vol", :default 0.1, :rate :kr, :value #atom[0.1 0x49c59e05]} {:name "ffreq", :default 1000.0, :rate :kr, :value #atom[1000.0 0x17557743]}), :args ("vol" "ffreq"), :sdef {:name "user/an-fnoise", :constants [20.0], :params (0.1 1000.0), :pnames ({:name "vol", :index 0} {:name "ffreq", :index 1}), :ugens ({:args nil, :special 0, :name "Control", :rate 1, :inputs (), :rate-name :kr, :n-outputs 2, :id 324, :outputs ({:rate 1} {:rate 1}), :n-inputs 0} #<sc-ugen: pink-noise:ar [0]> #<sc-ugen: binary-op-u-gen:ar [2]> #<sc-ugen: lpf:ar [4]> #<sc-ugen: out:ar [5]>)}, :group #<synth-group[live]: Inst an-fnoise Container 59>, :instance-group #<synth-group[live]: Inst an-fnoise 60>, :fx-group #<synth-group[live]: Inst an-fnoise FX 61>, :mixer #<synth-node[live]: overtone.stu547/mono-inst-mixer 62>, :bus #<audio-bus: No Name, mono, id 20>, :fx-chain [], :volume #atom[1.0 0x213195e5], :pan #atom[0.0 0x4604b0a3], :n-chans 1}

** actively filter noise with CC (remember, to use ctl, must have an active instance)
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(an-fnoise)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: overtone.examples.82a/an-fnoise 297>

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :control-change] (fn [{cc-channel :note velocity :velocity}]
                                     (ctl an-fnoise :ffreq (scale-range velocity 1 127 100 8000))
                                         10)
          ::cc-filterplayer)
#+END_SRC

#+RESULTS:
: :added-async-handler

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :note-on]
          (fn [m]
            (let [note (:note m)]
              (prophet :freq (midi->hz note)
                       :decay 5
                       :rq 0.6
                       :cutoff-freq 1000)))
          ::prophet-midi)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :note-on]
          (fn [m]
            (let [note (:note m)]
              (prophet :freq (midi->hz note)
                       :decay 5
                       :rq 0.6
                       :cutoff-freq 1000
                       :amp (:velocity-f m))))
          ::prophet-midi)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(on-event [:midi :control-change] (fn [{cc-channel :note velocity :velocity}]
                                    (ctl anoise :vol (scale-range velocity 1 127 0 1)))
          ::cc-player)
#+END_SRC
** make a recording

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(recording-start "/Users/a/Google Drive/wav-file-uploads/brown-noise-test.wav")
#+END_SRC

#+RESULTS:
: :recording-started

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
;; make some noise. i.e.
(demo (pan2 (sin-osc)))
#+END_SRC

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
;; stop recording
(recording-stop)

#+END_SRC

#+RESULTS:
: /Users/a/Google Drive/wav-file-uploads/brown-noise-test.wav

