src/post_tonal_overtone/org_files/html-versions/use-a-MIDI-controller.html
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">5.4</span> correctly grab and print out the cc-chanel and velocity (use :note and :velocity)</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{cc-channel <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
                             (println <span style="color: #CC9393;">"channel: "</span> cc-channel <span style="color: #CC9393;">", Velocity: "</span> velocity))
          <span style="color: #BFEBBF;">::cc-printer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::cc-printer</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">5.5</span> correctly grab and use as vol the cc-chanel and velocity (use :note and :velocity)</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{cc-channel <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
                                    (ctl anoise <span style="color: #BFEBBF;">:vol</span> (scale-range velocity 1 127 0 1)))
          <span style="color: #BFEBBF;">::cc-player</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::cc-player</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">5.6</span> use control change with noise filter?</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>]
          (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{cc-channel <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
            (lpf (ctl anoise <span style="color: #BFEBBF;">:vol</span> (scale-range velocity 1 127 0 1))
                 10)
            <span style="color: #BFEBBF;">::cc-filterplayer</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(demo 10
  (lpf (* 0.5 (saw [339 440]))
       (mouse-x 10 10000)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">5.7</span> use 'ctl' to make a real-time change</h3>
<div class="outline-text-3" id="text-5-7">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">an-fnoise</span> [vol 0.1 ffreq 1000]
  (lpf (* (pink-noise)
          vol)
       ffreq))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(an-fnoise)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(kill an-fnoise)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(ctl an-fnoise <span style="color: #BFEBBF;">:vol</span> 0.5 <span style="color: #BFEBBF;">:ffreq</span> 4000)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">5.8</span> actively filter noise with CC (remember, to use ctl, must have an active instance)</h3>
<div class="outline-text-3" id="text-5-8">
<div class="org-src-container">

<pre class="src src-clojure">(an-fnoise)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{cc-channel <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
                                     (ctl an-fnoise <span style="color: #BFEBBF;">:ffreq</span> (scale-range velocity 1 127 100 8000))
                                         10)
          <span style="color: #BFEBBF;">::cc-filterplayer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:note-on</span>]
          (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [m]
            (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (<span style="color: #BFEBBF;">:note</span> m)]
              (prophet <span style="color: #BFEBBF;">:freq</span> (midi-&gt;hz note)
                       <span style="color: #BFEBBF;">:decay</span> 5
                       <span style="color: #BFEBBF;">:rq</span> 0.6
                       <span style="color: #BFEBBF;">:cutoff-freq</span> 1000)))
          <span style="color: #BFEBBF;">::prophet-midi</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:note-on</span>]
          (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [m]
            (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (<span style="color: #BFEBBF;">:note</span> m)]
              (prophet <span style="color: #BFEBBF;">:freq</span> (midi-&gt;hz note)
                       <span style="color: #BFEBBF;">:decay</span> 5
                       <span style="color: #BFEBBF;">:rq</span> 0.6
                       <span style="color: #BFEBBF;">:cutoff-freq</span> 1000
                       <span style="color: #BFEBBF;">:amp</span> (<span style="color: #BFEBBF;">:velocity-f</span> m))))
          <span style="color: #BFEBBF;">::prophet-midi</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{cc-channel <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
                                    (ctl anoise <span style="color: #BFEBBF;">:vol</span> (scale-range velocity 1 127 0 1)))
          <span style="color: #BFEBBF;">::cc-player</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">5.9</span> make a recording</h3>
<div class="outline-text-3" id="text-5-9">
<div class="org-src-container">

<pre class="src src-clojure">(recording-start <span style="color: #CC9393;">"/Users/a/Google Drive/wav-file-uploads/brown-noise-test.wav"</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">make some noise. i.e.</span>
(demo (pan2 (sin-osc)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">stop recording</span>
(recording-stop)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: b</p>
<p class="date">Created: 2016-12-02 Fri 15:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
